{
    "type": ["Report", "Conference", "Journal", "Book", "Thesis", "Software"],
    "publications": [
        {
            "id": "10.1016-INFOSYS23",
            "title": "Conformance checking artefacts through weighted partial MaxSAT",
            "authors": ["Ojeda, Jesús"],
            "journal": "Information Systems",
            "doi": "10.1016/j.is.2023.102168",
            "year": 2023,
            "publication_date": "2023-01-07",
            "location": "",
            "volume": 114,
            "number": -1,
            "pages": "",
            "url": "https://doi.org/10.1016/j.is.2023.102168",
            "main_image": "infsystems23.png",
            "carousel": [],
            "abstract": ["Conformance checking techniques are based on the computation of artefacts which enable the reasoning about observed behaviour of processes and their models. A family of these related artefacts, alignments, multi- and anti-alignments are defined over a distance function between observed behaviour and model replay, both represented as words from a given alphabet. Encoding this distance function, commonly the Levenshtein distance, into MaxSAT enables us to take advantage of state-of-the-art MaxSAT solvers. In this paper we provide an improvement upon previous SAT encodings for the alignment artefact family. We achieve a reduction in the resulting formula size while also obtaining good performance results on the computation of the artefacts. Additionally, we provide its direct extension that allows to easily change the cost function for the alignment computation and show the implementation of two particular examples from the literature: prefix matching prioritization and synchronization maximization."],
            "tags": ["Alignment", "Conformance Checking", "Maximum Satisfiability"],
            "type": "Journal"
        },
        {
            "id": "10.1007-JHEUR",
            "title": "Incomplete MaxSAT approaches for combinatorial testing",
            "authors": ["Ansótegui, Carlos", "Manyà, Felip", "Ojeda, Jesús", "Salvia, Josep M.","Torres, Eduard"],
            "journal": "Journal of Heuristics",
            "doi": "10.1007/s10732-022-09495-3",
            "year": 2022,
            "publication_date": "2022-08-17",
            "location": "",
            "volume": 28,
            "number": 4,
            "pages": "377 - 431",
            "url": "https://doi.org/10.1007/s10732-022-09495-3",
            "main_image": "jheur22.png",
            "carousel": [],
            "abstract": ["We present a Satisfiability (SAT)-based approach for building Mixed Covering Arrays with Constraints of minimum length, referred to as the Covering Array Number problem. This problem is central in Combinatorial Testing for the detection of system failures. In particular, we show how to apply Maximum Satisfiability (MaxSAT) technology by describing efficient encodings for different classes of complete and incomplete MaxSAT solvers to compute optimal and suboptimal solutions, respectively. Similarly, we show how to solve through MaxSAT technology a closely related problem, the Tuple Number problem, which we extend to incorporate constraints. For this problem, we additionally provide a new MaxSAT-based incomplete algorithm. The extensive experimental evaluation we carry out on the available Mixed Covering Arrays with Constraints benchmarks and the comparison with state-of-the-art tools confirm the good performance of our approaches."],
            "tags": ["Combinatorial testing", "Constraint programming", "Maximum satisfiability"],
            "type": "Journal"
        },
        {
            "id": "10.1109-ICPM53251.2021.9576889",
            "title": "Partial MaxSAT Computation of Conformance Checking Artefacts",
            "authors": ["Ojeda, Jesús"],
            "journal": "3rd International Conference on Process Mining (ICPM)",
            "doi": "10.1109/ICPM53251.2021.9576889",
            "year": 2021,
            "publication_date": "2021-10-25",
            "location": "Eindhoven, Netherlands",
            "volume": -1,
            "number": -1,
            "pages": "14 - 24",
            "url": "https://doi.org/10.1109/ICPM53251.2021.9576889",
            "main_image": "icpm21.png",
            "carousel": [],
            "abstract": ["To reason about observed behaviour of processes and their models, conformance checking techniques are rooted in the computation of artefacts. Related artefacts like alignments, multi-alignments and anti-alignments are defined over a distance function, most commonly Hamming or Levenshtein distances. In this paper we provide a new Partial MaxSAT encoding of these artefacts based on the Levenshtein distance and compare with their current state-of-the-art SAT encodings. We show a reduction in the resulting formula size for our proposed encoding, while also obtaining good performance results on the computation of the artefacts."],
            "tags": ["Alignment", "Conformance Checking", "Maximum Satisfiability"],
            "type": "Conference"
        },
        {
            "id": "10.4230-LIPIcs.CP.2021.12",
            "title": "Building High Strength Mixed Covering Arrays with Constraints",
            "authors": ["Ansótegui, Carlos", "Ojeda, Jesús", "Torres, Eduard"],
            "journal": "27th International Conference on Principles and Practice of Constraint Programming (CP 2021)",
            "doi": "10.4230/LIPIcs.CP.2021.12",
            "year": 2021,
            "publication_date": "2021-10-15",
            "location": "",
            "volume": 210,
            "number": -1,
            "pages": "12:1 - 12:17",
            "url": "https://doi.org/10.4230/LIPIcs.CP.2021.12",
            "main_image": "cp21.png",
            "carousel": [],
            "abstract": ["Covering arrays have become a key piece in Combinatorial Testing. In particular, we focus on the efficient construction of Covering Arrays with Constraints of high strength. SAT solving technology has been proven to be well suited when solving Covering Arrays with Constraints. However, the size of the SAT reformulations rapidly grows up with higher strengths. To this end, we present a new incomplete algorithm that mitigates substantially memory blow-ups. The experimental results confirm the goodness of the approach, opening avenues for new practical applications. "],
            "tags": ["Combinatorial Testing", "Covering Arrays", "Maximum Satisfiability"],
            "type": "Conference"
        },
        {
            "id": "10.1007-978-3-030-80223-3_1",
            "title": "OptiLog: A Framework for SAT-based Systems",
            "authors": ["Ansótegui, Carlos", "Ojeda, Jesús","Pacheco, Antonio","Pon, Josep", "Salvia, Josep M.","Torres, Eduard"],
            "journal": "Theory and Applications of Satisfiability Testing -- SAT 2021. Lecture Notes in Computer Science",
            "doi": "10.1007/978-3-030-80223-3_1",
            "year": 2021,
            "publication_date": "2021-07-02",
            "location": "Barcelona, Spain",
            "volume": 12831,
            "number": -1,
            "pages": "1 - 10",
            "url": "https://doi.org/10.1007/978-3-030-80223-3_1",
            "main_image": "optilog_sat21.png",
            "carousel": [],
            "abstract": ["We present OptiLog, a new Python framework for rapid prototyping of SAT-based systems. OptiLog allows to use and integrate SAT solvers currently developed in C/C++ just by implementing the iSAT C++ interface. It also provides a Python binding to the PBLib C++ toolkit for encoding Pseudo Boolean and Cardinality constraints. Finally, it leverages thepower of automatic configurators by allowing to easily create configuration scenarios including multiple solvers and encoders."],
            "tags": ["satisifiability", "framework", "automatic configuration"],
            "type": "Conference"
        },
        {
            "id": "20210601jojeda",
            "title": "Incomplete MaxSAT Approaches for Combinatorial Testing",
            "authors": ["Ansótegui, Carlos", "Manyà, Felip", "Ojeda, Jesús", "Salvia, Josep M.","Torres, Eduard"],
            "journal": "CoRR",
            "year": 2021,
            "publication_date": "2021-06-01",
            "location": "",
            "volume": "abs/2105.12552",
            "number": -1,
            "pages": "",
            "url": "https://arxiv.org/abs/2105.12552",
            "main_image": "arxiv21_IncompleteCombTest.png",
            "carousel": [],
            "abstract": ["We present a Satisfiability (SAT)-based approach for building Mixed Covering Arrays with Constraints of minimum length, referred to as the Covering Array Number problem. This problem is central in Combinatorial Testing for the detection of system failures. In particular, we show how to apply Maximum Satisfiability (MaxSAT) technology by describing efficient encodings for different classes of complete and incomplete MaxSAT solvers to compute optimal and suboptimal solutions, respectively. Similarly, we show how to solve through MaxSAT technology a closely related problem, the Tuple Number problem, which we extend to incorporate constraints. For this problem, we additionally provide a new MaxSAT-based incomplete algorithm. The extensive experimental evaluation we carry out on the available Mixed Covering Arrays with Constraints benchmarks and the comparison with state-of-the-art tools confirm the good performance of our approaches."],
            "tags": ["Combinatorial Testing", "Covering Arrays", "Maximum Satisfiability"],
            "type": "Report"
        },
        {
            "id": "20180517jojeda",
            "title": "SYLVIUS: Virtual Reality Collaborative Workflow System for Stereotactic Electrode Implantation Procedures",
            "authors": ["Higueras-Esteban, Alfredo", "Ojeda, Jesús", "Delgado-Martínez, Ignacio", "Serrano, Laura", "Principe, Alessandro", "Rocamora, Rodrigo", "Conesa, Gerardo"],
            "journal": "XXII Congreso de la Sociedad Española de Neurocirugía (SENEC)",
            "year": 2018,
            "publication_date": "2018-05-17",
            "location": "Madrid, Spain",
            "volume": "",
            "number": -1,
            "pages": "",
            "url": "",
            "main_image": "sylvius.jpg",
            "carousel": [],
            "abstract": [
                "Planning stereotactic electrode implantation procedures requires precise communication of patient data among clinical disciplines, mainly epileptology and neurosurgery, both before and after surgery. Additionally, a natural and effective user interface allowing for data to be manipulated in 3D is becoming fundamental to understand the relationship between surgical plan and brain structures.",
                "We present SYLVIUS, a multimodal, virtual reality collaborative planning system which allows for easier communication among the different specialties involved in epilepsy surgery."
            ],
            "tags": ["SEEG", "virtual reality"],
            "type": "Conference"
        },
        {
            "id": "10.1007-s11548-018-1766-y",
            "title": "Automatic segmentation of deep brain electrodes used in stereotactic electroencephalography (SEEG)",
            "authors": ["Higueras-Esteban, Alfredo", "Ojeda, Jesús", "Delgado-Martínez, Ignacio", " Pérez-Enríquez Carmen", "Serrano, Laura", "Principe, Alessandro", "González-Ballester, Miguel Ángel", "Rocamora, Rodrigo", "Serra, Luis", "Conesa, Gerardo"],
            "journal": "International Journal of Computer Assisted Radiology and Surgery",
            "year": 2018,
            "publication_date": "2018-06-01",
            "location": "Berlin, Germany",
            "volume": "13",
            "number": "Suppl. 1 (CARS 2018, Berlin, Germany)",
            "pages": "79 - 81",
            "url": "https://doi.org/10.1007/s11548-018-1766-y",
            "main_image": "CARS_18_b.png",
            "carousel": ["CARS_18_b.png", "CARS_18_a.png"],
            "abstract": [
                "SEEG is a surgical procedure designed to help locate the epileptogenic zone in drug-resistant epileptic patients. It consists on the placement of several intracranial electrodes (typically 7–22) containing several contacts each (5–18). The electrical information retrieved from these contacts is key to determine which area of the brain should be resected or disconnected to stop epileptic seizures.",
                "To locate these contacts, it is common clinical practice to perform a postoperative CT scan which reveals the final position of the implanted electrodes. Segmenting these contacts manually for each patient is a tedious task.",
                "Several efforts have been made to automatize this procedure, sometimes requiring user input to select the coordinates of the entry and target points. These points could be obtained from the surgical plan, but this plan is sometimes modified intraoperatively. Sometimes the number of expected contacts for each electrode is also a required input further complicating automatization, as electrodes with different numbers of contacts may be implanted on each patient.",
                "The purpose of this work is to provide an automatic segmentation procedure to segment intracranial electrodes and their contacts from a post-operative CT scan not requiring other inputs nor user interaction. The only prior knowledge required by the algorithm consists in the geometrical parameters of the electrode."
            ],
            "tags": ["SEEG", "segmentation"],
            "type": "Journal"
        },
        {
            "id": "10.2312-conf-EG2013-short-025-028",
            "title": "Enhanced Lattice Boltzmann Shallow Waters for Real-time Fluid Simulations",
            "authors": ["Ojeda, Jesús", "Susín, Antonio"],
            "journal": "Eurographics 2013 - Short Papers",
            "year": 2013,
            "publication_date": "2013-05-01",
            "location": "Girona, Spain",
            "volume": "",
            "number": "",
            "pages": "",
            "url": "http://dx.doi.org/10.2312/conf/EG2013/short/025-028",
            "main_image": "eurographics13.png",
            "carousel": [],
            "abstract": [
                "We present a novel approach at simulating fluids in real-time by coupling the Lattice Boltzmann Method for Shallow Waters (LBMSW) with particle systems. The LBM can handle arbitrary underlying terrain and arbitrary fluid depth, which, in turn, allows us to extend it to track dry regions. The LBM is also two-way coupled with rigid bodies. The particle system adds more detail to the LBM; breaking waves are detected from the surface simulation and particles are generated to provide the effect, taking effectively certain amounts of fluid and reintegrating it back once they fall over again. Both the LBM and the particle simulation are implemented in CUDA, although rigid bodies are simulated in CPU. Finally, we show the effectiveness of the method on commodity hardware."
            ],
            "tags": ["Fluid Simulation", "Physically based Animation"],
            "type": "Conference"
        },
        {
            "id": "10.1007-978-3-662-44911-0_1",
            "title": "Real-Time Lattice Boltzmann Shallow Waters Method for Breaking Wave Simulations",
            "authors": ["Ojeda, Jesús", "Susín, Antonio"],
            "journal": "Communications in Computer and Information Science",
            "year": 2014,
            "publication_date": "2014-09-30",
            "location": "",
            "volume": "458",
            "number": "",
            "pages": "3 - 18",
            "url": "https://doi.org/10.1007/978-3-662-44911-0_1",
            "main_image": "visigrappp13.png",
            "carousel": [],
            "abstract": [
                "We present a new approach for the simulation of surface-based fluids based in a hybrid formulation of Lattice Boltzmann Method for Shallow Waters and particle systems. The modified LBM can handle arbitrary underlying terrain conditions and arbitrary fluid depth. It also introduces a novel method for tracking dry-wet regions and moving boundaries. Dynamic rigid bodies are also included in our simulations using a two-way coupling. Certain features of the simulation that the LBM can not handle because of its heightfield nature, as breaking waves, are detected and automatically turned into splash particles. Here we use a ballistic particle system, but our hybrid method can handle more complex systems as SPH. Both the LBM and particle systems are implemented in CUDA, although dynamic rigid bodies are simulated in CPU. We show the effectiveness of our method with various examples which achieve real-time on consumer-level hardware."
            ],
            "tags": ["Fluid Simulation", "Natural Phenomena", "Physically based Animation"],
            "type": "Journal"
        },
        {
            "id": "10.5220-0004211302170226",
            "title": "Hybrid particle Lattice Boltzmann shallow water for interactive fluid simulations",
            "authors": ["Ojeda, Jesús", "Susín, Antonio"],
            "journal": "Proceedings of the International Conference on Computer Graphics Theory and Applications and International Conference on Information Visualization Theory and Applications - GRAPP, (VISIGRAPP 2013)",
            "year": 2013,
            "publication_date": "2013-03-01",
            "location": "Barcelona, Spain",
            "volume": "",
            "number": "",
            "pages": "217 - 226",
            "url": "http://dx.doi.org/10.5220/0004211302170226",
            "main_image": "grapp13.png",
            "carousel": [],
            "abstract": [
                "We introduce a hybrid approach for the simulation of fluids based in the Lattice Boltzmann Method for Shallow Waters and particle systems. Our modified LBM Shallow Waters can handle arbitrary underlying terrain and arbitrary fluid depth. It also introduces a novel and simplified method of tracking dry-wet regions. Dynamic rigid bodies are also included in our simulations using a two-way coupling. Certain features of the simulation that the LBM can not handle, as breaking waves, are detected and automatically turned into splash particles. Albeit we use a simple ballistic particle system, our hybrid method can handle more complex systems as SPH. Both the LBM and particle systems are implemented in CUDA, yet dynamic rigid bodies are simulated in CPU. We show the effectiveness of our method with various examples which achieve real-time on commodity hardware."
            ],
            "tags": ["Fluid Simulation", "Natural Phenomena", "Physically based Animation"],
            "type": "Conference"
        },
        {
            "id": "20091119jojeda",
            "title": "Aceleración de simulaciones de fluidos Lattice Boltzmann utilizando CUDA",
            "authors": ["Ojeda, Jesús", "Susín, Antonio"],
            "journal": "II Workshop de Aplicaciones de Nuevas Arquitecturas de Consumo y Altas Prestaciones",
            "year": 2009,
            "publication_date": "2009-11-19",
            "location": "Madrid, Spain",
            "volume": "",
            "number": "",
            "pages": "",
            "url": "http://hdl.handle.net/2117/6599",
            "main_image": "anacap09.png",
            "carousel": [],
            "abstract": [],
            "tags": ["CUDA", "Fluid simulation", "LBM"],
            "type": "Conference"
        }
    ]
}
